{"id":124,"date":"2020-10-14T07:54:28","date_gmt":"2020-10-14T07:54:28","guid":{"rendered":"http:\/\/holyscientific2.v1st.co.in\/?page_id=124"},"modified":"2021-08-13T08:26:40","modified_gmt":"2021-08-13T08:26:40","slug":"deep-freezer","status":"publish","type":"page","link":"https:\/\/holyscientific.com\/deep-freezer\/","title":{"rendered":"Deep Freezer"},"content":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h4>SCOPE :-<\/h4>\n<p style=\"text-align: justify;\"><strong>HOLYSCIENTIFIC<\/strong> is one of the leading science equipment manufacturer &amp; exporter of science equipments, science instruments, lab equipments, lab instruments, testing equipments, testing instruments, like Digital bio-safety cabinet, vertical &amp; horizontal laminar air flow cooling &amp; heating instruments like ultra low temperature deep freezers, BOD incubators, hot air oven, muffle furnace, microscope, fume hood environmental test chamber, water distillation plant, SDI kit, ocean grapy meter, water testing kit, PH meter, soil samplers &amp; all types of laboratory &amp; science instruments. This laboratory &amp; scientific instruments used for laboratory sterilization, clean room, microbiology, pathology, bio technology, pharmaceuticals, seed &amp; soil testing, metallurgical, food processing, customized instruments<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;563&#8243; img_size=&#8221;full&#8221; style=&#8221;vc_box_border&#8221; image_hovers=&#8221;false&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>CONSTRUCTION :-<\/h4>\n<p style=\"text-align: justify;\"><strong>RASAYAN<\/strong> is the leading manufacturer of all types of laboratory deep freezers in region. Our deep freezers are widely used for day to day in various laboratory applications. We specialize in both standard and customized models, specifically designed to meet the challenging demands of various scientists for individual and specialized research applications. Laboratory professionals all over the world have recognized the dependability and efficiency of <strong>RASAYAN Freezers. RASAYAN lab equipment manufactures CFC- free efficient &amp; ultra dependable upright model ultra temp. Deep freezers with a various model of different Temperature like -20C, -40C, -80C at an ambient temperature of 25 C in different capacity.<\/strong><\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>MODE OF HEATING :-<\/h4>\n<p style=\"text-align: justify;\">RASAYAN DEEP freezers have double wall construction. Inner chamber made of thick highly polished stainless steel with dehydrated cooper tubing soldered to the external side (all sides) for instant and consistent cooling. Exterior made of thick mild steel sheet duly finished in enamel paint or pastle mat finish colour combination.(fully S.S model also available) double wall with CFC free poly urethane foam insulated door is provided with magnetic gasket and lock &amp; key arrangement for minimize heat loss. Gap between outer &amp; inner chamber also filled with PUF insulation. Castor wheel for easy mobility. Every freezer is fully tested under the most demanding conditions for seven days. The constant ultra-low set point operating temperature is assured in warm temperature environments A control panel is provided with temperature controller &amp; various indicators lick ON\/OFF switch cord plug, compressor ON\/OFF indication lamp, etc. (PLC based controlling with or without touch screen also available.)<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>Other Details:-<\/h4>\n<p>[\/vc_column_text]<div class=\"standard-arrow list-divider bullet-top\"><p><strong>FEATURES:<\/strong><\/p>\n<ul>\n<li>High-strength steel with corrosion-resistant coating for long-life durability.<\/li>\n<li>HD (high-density) composite thin-wall design creates more storage without increasing cabinet footprint<\/li>\n<li>Outer door gasket: unique door seal for sealing contact, protects against heat leaks and minimizes frost buildup<\/li>\n<li>Stainless-steel reinforced interior shelves, developed for excessive loads and impacts<\/li>\n<li>PLUS Power Management System: low-voltage surge protection, voltage buck\/boost capabilities<\/li>\n<li>Heavy-duty casters: 2 in. (5.1cm) locking tandem wheel design for easy, smooth mobility<\/li>\n<li>Stand-offs prevent freezer from being placed directly against the wall, ensuring proper air circulation to prevent overheating Door-mounted Pressure Equalization Port (PEP) allows for quick re-entries after door openings and eliminates the need for ice removal<\/li>\n<li>Integrated dr handle and latch fr ne-handed peratin; built-in key lck and padlck cmpatible Washable filter prvides prtectin frm dust n the cndenser, which can reduce refrigeratin perfrmance and increase risk t sample<\/li>\n<\/ul>\n<p><strong>MICROPROCESSOR CONTROL<\/strong><\/p>\n<ul>\n<li>Life-Guard Alert monitors performance and alerts user to changes in external and internal conditions<\/li>\n<li>Power failure alert automatically activates in the event of a power failure<\/li>\n<li>Temperature failure alert automatically activates in the event of temperature deviation<\/li>\n<li>Door-mounted control for eye-level contact<\/li>\n<li>Set point Security: key-operated switch for main power and alarm; locks in temperature and alarm set points<\/li>\n<li>Alarm reset mutes audible alarm and resets A.I.M. (Automatic Incident Monitor)<\/li>\n<li>Clear, easy-to-read LED digital display<\/li>\n<li>Touchpad data entry adjustable in 1° increments<\/li>\n<li>Back-up system: automatic refrigeration backup system that works in case of power failure.<\/li>\n<li>This backup system continues the system till the AlterNet power supply will be ON. Or 15 minutes without any jurck. indicator lights up when system is active<\/li>\n<li>Extreme ambient alert warns if room temperature can affect performance.<\/li>\n<li>Alarm battery low indicator flashes to indicate when to replace battery and displays current battery voltage when pressed<\/li>\n<li>Voltage indicator views incoming line voltage<\/li>\n<li>Cabinet temperature and set point controls<\/li>\n<li>LCD \/ TFT Display.<\/li>\n<li>Temperature data logger.<\/li>\n<li>Temperature Chart Recorder.<\/li>\n<li>Computer Interface &amp; software.<\/li>\n<li>Data store memory &amp; print function.<\/li>\n<li>In side temperature -10 °c to -85 °c<\/li>\n<li>155 mm (6”) foaming insulation.<\/li>\n<\/ul>\n<\/div>[vc_column_text]<\/p>\n<div style=\"overflow-x: auto;\">\n<table border=\"1\" width=\"100%\">\n<tbody>\n<tr>\n<td width=\"20%\">Temp. Range<\/td>\n<td>-50 to -86 degrees C<\/td>\n<\/tr>\n<tr>\n<td>Capacity<\/td>\n<td>100 Liters, 200 Liters, 500 liters And as Required.<\/td>\n<\/tr>\n<tr>\n<td>Controller<\/td>\n<td>Microprocessor \/ Micro-controller based temperature controller<\/td>\n<\/tr>\n<tr>\n<td>Temperature Display<\/td>\n<td>Digital LED\/LCD<\/td>\n<\/tr>\n<tr>\n<td>High &amp; Low Alarm<\/td>\n<td>Audio-visual high &amp; low temperature alarm<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><strong>Low Temperature Freezer Construction<\/strong><\/td>\n<\/tr>\n<tr>\n<td>Outer Panels<\/td>\n<td>Outer panels are made of CRC sheet or Stainless Steel<\/td>\n<\/tr>\n<tr>\n<td>Interior Panels<\/td>\n<td>Interior panels are made of Stainless Steel<\/td>\n<\/tr>\n<tr>\n<td>Door<\/td>\n<td>Standard front hinged lockable single\/double door unit with stainless steel panel &amp; Triple point Silicon Gasket seal between the door and the cabinet increases system efficiency.<\/td>\n<\/tr>\n<tr>\n<td>Insulation<\/td>\n<td>Polyurethane foam insulation with a thickness of 155mm<\/td>\n<\/tr>\n<tr>\n<td>Trays<\/td>\n<td>Adjustable stainless steel trays with perforated design<\/td>\n<\/tr>\n<tr>\n<td>Castors<\/td>\n<td>Castors for minimal effort mobility.<\/td>\n<\/tr>\n<tr>\n<td>Heater Harness<\/td>\n<td>Heater harness provides a dry exterior cabinet. Heater prevents condensation of moisture and is located under the channel cap which is between the lid and body of the cabinet.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><strong>Low Temperature Freezer Refrigeration system<\/strong><\/td>\n<\/tr>\n<tr>\n<td>Refrigeration system<\/td>\n<td>RASAYAN superior refrigeration system with Backup refrigeration system.<\/td>\n<\/tr>\n<tr>\n<td>Compressor<\/td>\n<td>Heavy duty dual compressors. The low stage compressor cycles off when the set point temperature is reached and the high stage compressor runs continuously enabling reduced power consumption, extends life, protects the thermal overload system, decreases noise levels and provides dependable and stable cooling. The compressor is distinguished by its excellent performance, low noise level and minimal vibration.<\/td>\n<\/tr>\n<tr>\n<td>Condenser<\/td>\n<td>Highly efficient, high capacity air cooled condenser with automatic condensate evaporating system. Dual condenser fans and aerodynamically shaped fan blades. Copper tubing with High side fin tube and low side shell tube design.<\/td>\n<\/tr>\n<tr>\n<td>Evaporator<\/td>\n<td>Tube on sheet type. Cooling-coils-in-the shelf design with cooling coils in direct contact with sample provides rapid freezing, improved sample temperature uniformity.<\/td>\n<\/tr>\n<tr>\n<td>Oil Separator<\/td>\n<td>Oil separator effectively separates the lubricant oil from refrigerant. (if applicable)<\/td>\n<\/tr>\n<tr>\n<td>Refrigerant<\/td>\n<td>Non-CFC\/HCFC environmental friendly based on compressor capacity.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><strong>Low Temperature Freezer Alarms<\/strong><\/td>\n<\/tr>\n<tr>\n<td>Alarms<\/td>\n<td>Audio-video alarm system to warn of high or low temperature. Optional alarm systems like door ajar, condenser faults etc. Optional Alarm system with Rechargeable battery backup.<\/td>\n<\/tr>\n<tr>\n<td colspan=\"2\"><strong>Low Temperature Freezer Controls<\/strong><\/td>\n<\/tr>\n<tr>\n<td>Temperature Controls<\/td>\n<td>Micro-processor based Temperature controller cum indicator.<\/td>\n<\/tr>\n<tr>\n<td>Data Recorder\/logger (Optional)<\/td>\n<td>Temperature chart recorder or data logger with software for storing data and downloading data to computer for storage &amp; print.<\/td>\n<\/tr>\n<tr>\n<td>Computer Interface (Optional)<\/td>\n<td>Temperature Controller with computer interface for computer based monitoring and data storage. Software is provided for monitoring and data recording.<\/td>\n<\/tr>\n<tr>\n<td>Memory &amp; Print (Optional)<\/td>\n<td>Memory for temperature data storage and printer port for printing stored data.<\/td>\n<\/tr>\n<tr>\n<td>High &amp; Low alarms<\/td>\n<td>Audio-visual high &amp; low temperature alarms.<\/td>\n<\/tr>\n<tr>\n<td>Back up refrigeration<\/td>\n<td>Automatic refrigeration backup system that works in case of power failure. This backup system continues the system till the AlterNet power supply will be ON. Or 15 minutes without any jurck. Indicator lights up when system is active. This system provide 72 hour battery backup for controller.<\/td>\n<\/tr>\n<tr>\n<td>Power Supply<\/td>\n<td>220 volts, 50Hz<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<\/div>\n<p>[\/vc_column_text]<div class=\"standard-arrow list-divider bullet-top\"><p><strong>REFRIGERATION SYSTEM :<\/strong><\/p>\n<p style=\"text-align: justify;\">Cooling coils are dehydrated cooper tubing soldered to the external side of the working chamber (all sides) for instant and consistent cooling. Refrigeration system equipped with hermetically sealed, air-cooled compressors. The applied degassed and dried oil protects against wastage and prolongs the life time of the compressors. Air-Cooled condenser removes the heat from the compressor compartments by means of ventilation Electrical overload protection is provided on compressors Higher heat removal capacity than competitive freezers, ensuring faster temperature recovery after door openings Environmentally friendly, CFC-free refrigerants used in both higher low-stage models.<\/p>\n<p><strong>Temperature range<\/strong><br \/>\nTemperature range:-minus 5 °c to minus 86 °c<br \/>\nTemperature sensitivity: – + 1 °c or better.<br \/>\nTemperature Control: By digital Dual display Temperature controller with PT 100 sensor<\/p>\n<p><strong>ALARM SYSTEM<\/strong><\/p>\n<p style=\"text-align: justify;\">Battery operated alarm system will emit an audible and visual signal when there is a mechanical or electrical failure. The alarm has an over and under temperature setting, alarm silencing switch, and battery test switch. (Only in PLC model.)<\/p>\n<p><strong>DOCUMENTATION<\/strong><\/p>\n<ul>\n<li>Warranty certificate<\/li>\n<li>User’s manual.<\/li>\n<li>NABL traceable certificate.<\/li>\n<\/ul>\n<p><strong>OPTIONAL<\/strong><\/p>\n<ul>\n<li>Universal data logger<\/li>\n<li>PLC based controller with or without touch screen control panel.<\/li>\n<li>PPI make PID based programmable controller with original sensor Temperature Accuracy: &lt; 0.5 °C Chart recorder.<\/li>\n<\/ul>\n<\/div>[\/vc_column][\/vc_row]<\/p>\n<p>[vc_row][vc_column width=&#8221;1\/3&#8243;][\/vc_column][vc_column width=&#8221;1\/3&#8243;][\/vc_column][vc_column width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;693&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221; onclick=&#8221;custom_link&#8221; img_link_target=&#8221;_blank&#8221; image_hovers=&#8221;false&#8221; link=&#8221;\/wp-content\/uploads\/2019\/11\/RASAYAN-Deep-freezer-simple.pdf&#8221;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text] SCOPE :- HOLYSCIENTIFIC is one of the leading science equipment manufacturer &amp; exporter of science equipments, science instruments, lab equipments, lab instruments, testing equipments, testing instruments, like Digital bio-safety cabinet, vertical &amp; horizontal laminar air flow cooling &amp; heating instruments like ultra low temperature deep freezers, BOD incubators, hot air oven, muffle furnace,&hellip;<\/p>\n","protected":false},"author":1,"featured_media":563,"parent":0,"menu_order":56,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"categories":[8],"tags":[],"_links":{"self":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages\/124"}],"collection":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/comments?post=124"}],"version-history":[{"count":2,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages\/124\/revisions"}],"predecessor-version":[{"id":1630,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages\/124\/revisions\/1630"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/media\/563"}],"wp:attachment":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/media?parent=124"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/categories?post=124"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/tags?post=124"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}