{"id":232,"date":"2019-10-15T07:35:24","date_gmt":"2019-10-15T07:35:24","guid":{"rendered":"http:\/\/holyscientific2.v1st.co.in\/?page_id=232"},"modified":"2021-03-25T07:38:43","modified_gmt":"2021-03-25T07:38:43","slug":"block-digestion","status":"publish","type":"page","link":"https:\/\/holyscientific.com\/block-digestion\/","title":{"rendered":"Block Digestion"},"content":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text]<\/p>\n<h4>SCOPE :-<\/h4>\n<p style=\"text-align: justify;\">HOLY SCIENTIFIC is one of the leading science equipment manufacturer &amp; exporter of science equipments, science instruments, lab equipments, lab instruments, testing equipments, testing instruments, like Digital bio-safety cabinet, vertical &amp; horizontal laminar air flow cooling &amp; heating instruments like ultra low temperature deep freezers, BOD incubators, hot air oven, muffle furnace, microscope, fume hood environmental test chamber, water distillation plant, SDI kit, ocean grapy meter, water testing kit, PH meter, soil samplers &amp; all types of laboratory &amp; science instruments. This laboratory &amp; scientific instruments used for laboratory sterilization, clean room, microbiology, pathology, bio technology, pharmaceuticals, seed &amp; soil testing, metallurgical, food processing, customized instruments<\/p>\n<p>[\/vc_column_text][\/vc_column][vc_column width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;803&#8243; img_size=&#8221;full&#8221; style=&#8221;vc_box_border&#8221; image_hovers=&#8221;false&#8221;][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>CONSTRUCTION :-<\/h4>\n<p style=\"text-align: justify;\">The Kjeldahl Method consists in a procedure of catalytically supported mineralization of organic material in a boiling mixture of sulfuric acid and sulfate salts at digestion temperatures between 340 and 400°C. In the digestion process the organically bonded nitrogen is converted into ammonium sulfate. Alkalizing the solution liberates ammonia which is quantitatively steam-distilled and determined by titration.<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>MODE OF HEATING :-<\/h4>\n<p style=\"text-align: justify;\">The unit has a very heavy casted top made of 304 Grades stainless steel or Alluminium block with room for heating 40 digestion tubes made of highly energy efficient borosilicate glass of 75 ml each. The suitable value heating element are made of high grade kanthal A-I non Magnetic wire. These heaters are strategically placed throughout the chamber for uniform Temperature distribution through the chamber. The outer casing of the equipment is made of Thick PCRC sheet duly pre treated with primers for rust proofing and painted with attractive stove enamel paint or powder coated. The gap between the two walls is filled with sera wool in order to gain minimal thermal loss and maximum energy efficiency.<\/p>\n<p>[\/vc_column_text][\/vc_column][\/vc_row][vc_row][vc_column][vc_column_text]<\/p>\n<h4>Other Details:-<\/h4>\n<p>[\/vc_column_text]<div class=\"standard-arrow list-divider bullet-top\"><div class=\"products_box\">\n<p><strong>DIGESTION UNIT CONSIST OF<\/strong><\/p>\n<ul>\n<li>Main unit with Digester block.<\/li>\n<li>Exhaust manifold<\/li>\n<li>Glass vial.<\/li>\n<li>S.S. carrying case stands for vial.<\/li>\n<\/ul>\n<p style=\"text-align: justify;\">To manage the sulfuric acid fumes which are created during digestion, an exhaust manifold covers the open end of the digestion tubes. The manifold is connected to a vacuum source such as a faucet aspirator or a scrubber. The environmentally considerate scrubber cools and neutralizes the acid fumes and does not require the use of continuously running water. Fume control is a very important aspect of digestion. If fumes are left to vent into the sample place, there would be significant loss of acid and subsequent hardening of the dig estate, not to mention rapid deterioration of the place. The exhaust manifold and regulated vacuum allows the acid fumes to properly reflux in the digestion tube, for optimized digestion.<\/p>\n<p style=\"text-align: justify;\">On these systems the heating level is adjusted using Continuous controls. The optimized design of the heating chambers reliably ensures all samples are homogeneously heated, an aspect that prevents the foaming of critical samples. For the digestion working in a fume hood is highly recommended and the use of the Scrubber which provides additional safety to laboratory personnel and environment as well as offering protection of the equipment against corrosion. Composed of an optional “Scrubber unit” that blocks the passage and neutralizes the condensed acids, and vacuum pump that produces sufficient vacuum to aspirate the vapors’. It is essential to put the “Scrubber” unit together with the neutralizer solution between the digestion block and the re-circulating pump<\/p>\n<ul>\n<li>Kjeldahl Dry Block Digester Designed for high temperature multi-function dry bath heating<\/li>\n<li>A complete device for safe digestion of up to 20 sample simultaneously.<\/li>\n<li>The sample tubes are consistently heated and digestion fumes are completely collected using the Scrubber.<\/li>\n<li>Digestion temperature and time can be entered and read on the display at any time<\/li>\n<li>Countdown time indicator is displayed.Precise temperature control from ambient +5°C to 425°C with ±2°C accuracy.<\/li>\n<li>User’s self compensation functions for temperature to counter for difference between block temperature and sample temperature.<\/li>\n<li>Fitted with Microprocessor Based Digital Temperature<\/li>\n<li>Indicator cum Controller for auto control with respect to time and temperature and is also fitted with IN-BUILT BUZZER TIMER for AUTO CONTROL to indicate cycle end.<\/li>\n<li>Kjeldhal Dry Block Digester is Microprocessor Based Digital Temperature Indicator cum Controller having individual display for set value and process value.<\/li>\n<li>Over temperature protector works as a safety device.<\/li>\n<li>Fitted with ELCB for current leakage protection.<\/li>\n<li>Extra heavy wall vial with compatible heat resistance of 450C<\/li>\n<li>Easily observable digestion process<\/li>\n<li>Temperature indicator and countdown time indicator<\/li>\n<li>Fitted with AUTOMATIC DIGITAL MINUTE TIMER which starts automatically when set\/desired value of temperature is achieved. When the set time period is over the heaters get switched off automatically.<\/li>\n<li>2.0 K.W energy efficient heater for super fast heating.(heater capacity will be vary as per model.)<\/li>\n<\/ul>\n<\/div>\n<\/div>[\/vc_column][\/vc_row][vc_row][vc_column width=&#8221;1\/3&#8243;][\/vc_column][vc_column width=&#8221;1\/3&#8243;][\/vc_column][vc_column width=&#8221;1\/3&#8243;][vc_single_image image=&#8221;693&#8243; img_size=&#8221;full&#8221; alignment=&#8221;center&#8221; onclick=&#8221;custom_link&#8221; img_link_target=&#8221;_blank&#8221; image_hovers=&#8221;false&#8221; link=&#8221;\/wp-content\/uploads\/2019\/11\/block-digestion.pdf&#8221;][\/vc_column][\/vc_row]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>[vc_row][vc_column width=&#8221;2\/3&#8243;][vc_column_text] SCOPE :- HOLY SCIENTIFIC is one of the leading science equipment manufacturer &amp; exporter of science equipments, science instruments, lab equipments, lab instruments, testing equipments, testing instruments, like Digital bio-safety cabinet, vertical &amp; horizontal laminar air flow cooling &amp; heating instruments like ultra low temperature deep freezers, BOD incubators, hot air oven, muffle&hellip;<\/p>\n","protected":false},"author":1,"featured_media":803,"parent":0,"menu_order":23,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"categories":[5],"tags":[],"_links":{"self":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages\/232"}],"collection":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/comments?post=232"}],"version-history":[{"count":0,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/pages\/232\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/media\/803"}],"wp:attachment":[{"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/media?parent=232"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/categories?post=232"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/holyscientific.com\/wp-json\/wp\/v2\/tags?post=232"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}